Revit 2024 API
ParameterTypeId.RebarSystemBarTypeFrontDirn1 Property
 "Exterior Major Bar Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RebarSystemBarTypeFrontDirn1 { get; }
Visual Basic
Public Shared ReadOnly Property RebarSystemBarTypeFrontDirn1 As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RebarSystemBarTypeFrontDirn1 {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace